brzk4/Modbus-slave-STM8s/Libraries/STM8_TouchSensing_Driver/src/stm8_tsl_multichannelkey.c
/**
  ******************************************************************************
  * @file    stm8_tsl_multichannelkey.c
  * @author  MCD Application Team
  * @version V2.3.1
  * @date    14-February-2011
  * @brief   STM8 Touch Sensing Library - This file provides the functions to
  *          manage the multi channel Key (wheel/slider).
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
  */

/* Includes ------------------------------------------------------------------*/
#include "stm8_tsl_multichannelkey.h"
#include "stm8_tsl_api.h"
#include "stm8_tsl_services.h"

/* CONDITIONAL COMPILING FOR MCKEYS */
#if NUMBER_OF_MULTI_CHANNEL_KEYS > 0

/* Memory section ------------------------------------------------------------*/
#if defined(_COSMIC_) && defined(USE_PRAGMA_SECTION)
#pragma section [TSLMCK_RAM]
#pragma section @tiny [TSLMCK_RAM0]
#pragma section (TSLMCK_CODE)
#pragma section const {TSLMCK_CONST}
#endif

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

#ifdef CHARGE_TRANSFER

__CONST Info_Channel * Channel_address_tab[] = {
      &Channel_P1
#if NUMBER_OF_ACQUISITION_PORTS > 1
      , &Channel_P2
#endif
#if NUMBER_OF_ACQUISITION_PORTS > 2
      , &Channel_P3
#endif
    };

/*look up table for the channel and group corresponding*/
__CONST u8 MCKEY1_LOOK_TABLE[CHANNEL_PER_MCKEY][2] = {
      /********MCKEY1_A************/
#if MCKEY1_A_CH == SCKEY_P1_CH
      0x00
#elif MCKEY1_A_CH == SCKEY_P2_CH
      0x01
#else //MCKEY1_A_CH == SCKEY_P3_CH
      0x02
#endif
#if   (MCKEY1_A == GROUP1)
      , 0x00
#elif (MCKEY1_A == GROUP2)
      , 0x01
#elif (MCKEY1_A == GROUP3)
      , 0x02
#elif (MCKEY1_A == GROUP4)
      , 0x03
#elif (MCKEY1_A == GROUP5)
      , 0x04
#elif (MCKEY1_A == GROUP6)
      , 0x05
#elif (MCKEY1_A == GROUP7)
      , 0x06
#elif (MCKEY1_A == GROUP8)
      , 0x07
#endif

      /********MCKEY1_B************/
#if MCKEY1_B_CH == SCKEY_P1_CH
      , 0x00
#elif MCKEY1_B_CH == SCKEY_P2_CH
      , 0x01
#else //MCKEY1_A_CH == SCKEY_P3_CH
      , 0x02
#endif
#if   (MCKEY1_B == GROUP1)
      , 0x00
#elif (MCKEY1_B == GROUP2)
      , 0x01
#elif (MCKEY1_B == GROUP3)
      , 0x02
#elif (MCKEY1_B == GROUP4)
      , 0x03
#elif (MCKEY1_B == GROUP5)
      , 0x04
#elif (MCKEY1_B == GROUP6)
      , 0x05
#elif (MCKEY1_B == GROUP7)
      , 0x06
#elif (MCKEY1_B == GROUP8)
      , 0x07
#endif

      /********MCKEY1_C************/
#if MCKEY1_C_CH == SCKEY_P1_CH
      , 0x00
#elif MCKEY1_C_CH == SCKEY_P2_CH
      , 0x01
#else //MCKEY1_A_CH == SCKEY_P3_CH
      , 0x02
#endif
#if   (MCKEY1_C == GROUP1)
      , 0x00
#elif (MCKEY1_C == GROUP2)
      , 0x01
#elif (MCKEY1_C == GROUP3)
      , 0x02
#elif (MCKEY1_C == GROUP4)
      , 0x03
#elif (MCKEY1_C == GROUP5)
      , 0x04
#elif (MCKEY1_C == GROUP6)
      , 0x05
#elif (MCKEY1_C == GROUP7)
      , 0x06
#elif (MCKEY1_C == GROUP8)
      , 0x07
#endif

#if CHANNEL_PER_MCKEY > 3
      /********MCKEY1_D************/
#if MCKEY1_D_CH == SCKEY_P1_CH
      , 0x00
#elif MCKEY1_D_CH == SCKEY_P2_CH
      , 0x01
#else //MCKEY1_D_CH == SCKEY_P3_CH
      , 0x02
#endif
#if   (MCKEY1_D == GROUP1)
      , 0x00
#elif (MCKEY1_D == GROUP2)
      , 0x01
#elif (MCKEY1_D == GROUP3)
      , 0x02
#elif (MCKEY1_D == GROUP4)
      , 0x03
#elif (MCKEY1_D == GROUP5)
      , 0x04
#elif (MCKEY1_D == GROUP6)
      , 0x05
#elif (MCKEY1_D == GROUP7)
      , 0x06
#elif (MCKEY1_D == GROUP8)
      , 0x07
#endif

      /********MCKEY1_E************/
#if MCKEY1_E_CH == SCKEY_P1_CH
      , 0x00
#elif MCKEY1_E_CH == SCKEY_P2_CH
      , 0x01
#else //MCKEY1_E_CH == SCKEY_P3_CH
      , 0x02
#endif
#if   (MCKEY1_E == GROUP1)
      , 0x00
#elif (MCKEY1_E == GROUP2)
      , 0x01
#elif (MCKEY1_E == GROUP3)
      , 0x02
#elif (MCKEY1_E == GROUP4)
      , 0x03
#elif (MCKEY1_E == GROUP5)
      , 0x04
#elif (MCKEY1_E == GROUP6)
      , 0x05
#elif (MCKEY1_E == GROUP7)
      , 0x06
#elif (MCKEY1_E == GROUP8)
      , 0x07
#endif
#endif

#if CHANNEL_PER_MCKEY > 5
      /********MCKEY1_A************/
#if MCKEY1_F_CH == SCKEY_P1_CH
      , 0x00
#elif MCKEY1_F_CH == SCKEY_P2_CH
      , 0x01
#else //MCKEY1_F_CH == SCKEY_P3_CH
      , 0x02
#endif
#if   (MCKEY1_F == GROUP1)
      , 0x00
#elif (MCKEY1_F == GROUP2)
      , 0x01
#elif (MCKEY1_F == GROUP3)
      , 0x02
#elif (MCKEY1_F == GROUP4)
      , 0x03
#elif (MCKEY1_F == GROUP5)
      , 0x04
#elif (MCKEY1_F == GROUP6)
      , 0x05
#elif (MCKEY1_F == GROUP7)
      , 0x06
#elif (MCKEY1_F == GROUP8)
      , 0x07
#endif

      /********MCKEY1_B************/
#if MCKEY1_G_CH == SCKEY_P1_CH
      , 0x00
#elif MCKEY1_G_CH == SCKEY_P2_CH
      , 0x01
#else //MCKEY1_G_CH == SCKEY_P3_CH
      , 0x02
#endif
#if   (MCKEY1_G == GROUP1)
      , 0x00
#elif (MCKEY1_G == GROUP2)
      , 0x01
#elif (MCKEY1_G == GROUP3)
      , 0x02
#elif (MCKEY1_G == GROUP4)
      , 0x03
#elif (MCKEY1_G == GROUP5)
      , 0x04
#elif (MCKEY1_G == GROUP6)
      , 0x05
#elif (MCKEY1_G == GROUP7)
      , 0x06
#elif (MCKEY1_G == GROUP8)
      , 0x07
#endif

      /********MCKEY1_C************/
#if MCKEY1_H_CH == SCKEY_P1_CH
      , 0x00
#elif MCKEY1_H_CH == SCKEY_P2_CH
      , 0x01
#else //MCKEY1_H_CH == SCKEY_P3_CH
      , 0x02
#endif
#if   (MCKEY1_H == GROUP1)
      , 0x00
#elif (MCKEY1_H == GROUP2)
      , 0x01
#elif (MCKEY1_H == GROUP3)
      , 0x02
#elif (MCKEY1_H == GROUP4)
      , 0x03
#elif (MCKEY1_H == GROUP5)
      , 0x04
#elif (MCKEY1_H == GROUP6)
      , 0x05
#elif (MCKEY1_H == GROUP7)
      , 0x06
#elif (MCKEY1_H == GROUP8)
      , 0x07
#endif
#endif
    };
#endif

