brzk4/Modbus-slave-STM8s/Libraries/STM8_TouchSensing_Driver/src/stm8_tsl_multichannelkey.c
#if CHANNEL_PER_MCKEY > 5
      /********MCKEY2_A************/
#if MCKEY2_F_CH == SCKEY_P1_CH
      0x00
#else //port 2 is used
      0x01
#endif
#if   (MCKEY2_F == GROUP1)
      , 0x00
#elif (MCKEY2_F == GROUP2)
      , 0x01
#elif (MCKEY2_F == GROUP3)
      , 0x02
#elif (MCKEY2_F == GROUP4)
      , 0x03
#elif (MCKEY2_F == GROUP5)
      , 0x04
#elif (MCKEY2_F == GROUP6)
      , 0x05
#elif (MCKEY2_F == GROUP7)
      , 0x06
#elif (MCKEY2_F == GROUP8)
      , 0x07
#endif

      /********MCKEY2_B************/
#if MCKEY2_G_CH == SCKEY_P1_CH
      , 0x00
#else //port 2 is used
      , 0x01
#endif
#if   (MCKEY2_G == GROUP1)
      , 0x00
#elif (MCKEY2_G == GROUP2)
      , 0x01
#elif (MCKEY2_G == GROUP3)
      , 0x02
#elif (MCKEY2_G == GROUP4)
      , 0x03
#elif (MCKEY2_G == GROUP5)
      , 0x04
#elif (MCKEY2_G == GROUP6)
      , 0x05
#elif (MCKEY2_G == GROUP7)
      , 0x06
#elif (MCKEY2_G == GROUP8)
      , 0x07
#endif

      /********MCKEY2_C************/
#if MCKEY2_H_CH == SCKEY_P1_CH
      , 0x00
#else //port 2 is used
      , 0x01
#endif
#if   (MCKEY2_H == GROUP1)
      , 0x00
#elif (MCKEY2_H == GROUP2)
      , 0x01
#elif (MCKEY2_H == GROUP3)
      , 0x02
#elif (MCKEY2_H == GROUP4)
      , 0x03
#elif (MCKEY2_H == GROUP5)
      , 0x04
#elif (MCKEY2_H == GROUP6)
      , 0x05
#elif (MCKEY2_H == GROUP7)
      , 0x06
#elif (MCKEY2_H == GROUP8)
      , 0x07
#endif
#endif
    };

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//-----        MCKEY2 __CONSTANT TABLES FOR POSITION CALCULATION           -----
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

#if CHANNEL_PER_MCKEY == 3
#if MCKEY2_TYPE == 0 // Wheel
#if MCKEY2_LAYOUT_TYPE == 0 // Interlaced electrodes
__CONST s16 MCKEY2_TABLE_POSITION_OFFSET[CHANNEL_PER_MCKEY][CHANNEL_PER_MCKEY] =
  {
    // sec = 1     2     3
    //   j = 0     1     2
    0,  -64, 107, // maj = 1; i = 0
    21,    0, -107, // maj = 2; i = 1
    -149,   64,   0  // maj = 3; i = 2

    // sec = 1     2     3
    //   j = 0     1     2
    //         0,  -96, 160, // maj = 1; i = 0
    //         32,    0, -160, // maj = 2; i = 1
    //        -224,   96,   0  // maj = 3; i = 2

  };
#define MCKEY2_SECTOR_COMPUTATION  (85)
#define MCKEY2_POSITION_CORRECTION (43)
//#define MCKEY2_SECTOR_COMPUTATION  (128)
//#define MCKEY2_POSITION_CORRECTION (128)
#else // Normal electrodes
__CONST s16 MCKEY2_TABLE_POSITION_OFFSET[CHANNEL_PER_MCKEY][CHANNEL_PER_MCKEY] =
  {
    // sec = 1     2     3
    //   j = 0     1     2
    0,  -19, -83, // maj = 1; i = 0
    0,    0, -32, // maj = 2; i = 1
    70,   19,   0  // maj = 3; i = 2
  };
#define MCKEY2_SECTOR_COMPUTATION (51)
#define MCKEY2_POSITION_CORRECTION (0)
#endif
#endif

#if MCKEY2_TYPE == 1 // Slider
#if MCKEY2_LAYOUT_TYPE == 0 // Interlaced electrodes
__CONST s16 MCKEY2_TABLE_POSITION_OFFSET[CHANNEL_PER_MCKEY][CHANNEL_PER_MCKEY] =
  {
    // sec = 1     2     3
    //   j = 0     1     2
    //         0,  -64, 107, // maj = 1; i = 0
    //         21,    0, -107, // maj = 2; i = 1
    //        -149,   64,   0  // maj = 3; i = 2

    // sec = 1     2     3
    //   j = 0     1     2
    0,  -96, 160, // maj = 1; i = 0
    32,    0, -160, // maj = 2; i = 1
    -224,   96,   0  // maj = 3; i = 2
  };
//#define MCKEY2_SECTOR_COMPUTATION  (85)
//#define MCKEY2_POSITION_CORRECTION (43)
#define MCKEY2_SECTOR_COMPUTATION  (128)
#define MCKEY2_POSITION_CORRECTION (128)
#else // Normal electrodes
__CONST s16 MCKEY2_TABLE_POSITION_OFFSET[CHANNEL_PER_MCKEY][CHANNEL_PER_MCKEY] =
  {
    // sec = 1     2     3
    //   j = 0     1     2
    0,  -19, -83, // maj = 1; i = 0
    0,    0, -32, // maj = 2; i = 1
    70,   19,   0  // maj = 3; i = 2
  };
#define MCKEY2_SECTOR_COMPUTATION (85)
#define MCKEY2_POSITION_CORRECTION (85)
#endif
#endif

#endif // CHANNEL_PER_MCKEY == 3

#if CHANNEL_PER_MCKEY == 5

#if MCKEY2_TYPE == 0 // Wheel
#if MCKEY2_LAYOUT_TYPE == 0 // Interlaced electrodes
__CONST s16 MCKEY2_TABLE_POSITION_OFFSET[CHANNEL_PER_MCKEY][CHANNEL_PER_MCKEY] =
  {
    // sec = 1     2     3     4     5
    //   j = 0     1     2     3     4
    0,  -19, -83,  122,   58, // maj = 1; i = 0
    6,    0, -32, -122,   96, // maj = 2; i = 1
    70,   19,   0,  -45,  -96, // maj = 3; i = 2
    -6,  109,  32,    0,  -58, // maj = 4; i = 3
    -70, -109,  83,   45,    0  // maj = 5; i = 4
  };
#define MCKEY2_SECTOR_COMPUTATION (26)
#define MCKEY2_POSITION_CORRECTION (0)
#else // Normal electrodes
__CONST s16 MCKEY2_TABLE_POSITION_OFFSET[CHANNEL_PER_MCKEY][CHANNEL_PER_MCKEY] =
  {
    // sec = 1     2     3     4     5
    //   j = 0     1     2     3     4
    0,  -38,   0,    0,  115, // maj = 1; i = 0
    13,    0, -64,    0,    0, // maj = 2; i = 1
    0,   38,   0,  -90,    0, // maj = 3; i = 2
    0,    0,  64,    0, -115, // maj = 4; i = 3
    -13,    0,   0,   90,    0  // maj = 5; i = 4
  };
#define MCKEY2_SECTOR_COMPUTATION (51)
#define MCKEY2_POSITION_CORRECTION (0)
#endif
#endif

#if MCKEY2_TYPE == 1 // Slider
#if MCKEY2_LAYOUT_TYPE == 0 // Interlaced electrodes
__CONST s16 MCKEY2_TABLE_POSITION_OFFSET[CHANNEL_PER_MCKEY][CHANNEL_PER_MCKEY] =
  {
    // sec = 1     2     3     4     5
    //   j = 0     1     2     3     4
    0,  -21, -92,  135,   64, // maj = 1; i = 0
    7,    0, -36, -135,  107, // maj = 2; i = 1
    78,   21,   0,  -50, -107, // maj = 3; i = 2
    -149,  121,  36,    0,  -64, // maj = 4; i = 3
    -78, -121,  92,   50,    0  // maj = 5; i = 4
  };
#define MCKEY2_SECTOR_COMPUTATION (28)
#define MCKEY2_POSITION_CORRECTION (28)
#else // Normal electrodes
__CONST s16 MCKEY2_TABLE_POSITION_OFFSET[CHANNEL_PER_MCKEY][CHANNEL_PER_MCKEY] =
  {
    // sec = 1     2     3     4     5
    //   j = 0     1     2     3     4
    0,  -64,    0,    0,    0, // maj = 1; i = 0
    21,    0, -107,    0,    0, // maj = 2; i = 1
    0,   64,    0, -149,    0, // maj = 3; i = 2
    0,    0,  107,    0, -192, // maj = 4; i = 3
    0,    0,    0,  149,    0  // maj = 5; i = 4
  };
#define MCKEY2_SECTOR_COMPUTATION (85)
#define MCKEY2_POSITION_CORRECTION (85)
#endif
#endif

#endif // CHANNEL_PER_MCKEY == 5

#if CHANNEL_PER_MCKEY == 8

#if MCKEY2_TYPE == 0 // Wheel
#if MCKEY2_LAYOUT_TYPE == 0 // Interlaced electrodes
__CONST s16 MCKEY2_TABLE_POSITION_OFFSET[CHANNEL_PER_MCKEY][CHANNEL_PER_MCKEY] =
  {
    // sec = 1     2     3     4     5     6     7     8
    //   j = 0     1     2     3     4     5     6     7
    0,  -12,    0,  -76,    0,  124,    0,   60, // maj = 1; i = 0
    4,    0,  -20,    0, -100,    0,   84,    0, // maj = 2; i = 1
    0,   12,    0,  -28,    0, -124,    0,  108, // maj = 3; i = 2
    68,    0,   20,    0,  -36,    0,  -84,    0, // maj = 4; i = 3
    0,   92,    0,   28,    0,  -44,    0, -108, // maj = 5; i = 4
    -4,    0,  116,    0,   36,    0,  -52,    0, // maj = 6; i = 5
    0,  -92,    0,   76,    0,   44,    0,  -60, // maj = 7; i = 6
    -68,    0, -116,    0,  100,    0,   52,    0  // maj = 8; i = 7
  };
#define MCKEY2_SECTOR_COMPUTATION (16)
#define MCKEY2_POSITION_CORRECTION (0)
#else // Normal electrodes
__CONST s16 MCKEY2_TABLE_POSITION_OFFSET[CHANNEL_PER_MCKEY][CHANNEL_PER_MCKEY] =
  {
    // sec = 1     2     3     4     5     6     7     8
    //   j = 0     1     2     3     4     5     6     7
    0,  -24,    0,    0,    0,    0,    0,  120, // maj = 1; i = 0
    8,    0,  -40,    0,    0,    0,    0,    0, // maj = 2; i = 1
    0,   24,    0,  -56,    0,    0,    0,    0, // maj = 3; i = 2
    0,    0,   40,    0,  -72,    0,    0,    0, // maj = 4; i = 3
    0,    0,    0,   56,    0,  -88,    0,    0, // maj = 5; i = 4
    0,    0,    0,    0,   72,    0, -104,    0, // maj = 6; i = 5
    0,    0,    0,    0,    0,   88,    0, -120, // maj = 7; i = 6
    -8,    0,    0,    0,    0,    0,  104,    0  // maj = 8; i = 7
  };
#define MCKEY2_SECTOR_COMPUTATION (32)
#define MCKEY2_POSITION_CORRECTION (0)
#endif
#endif

